REport Request.txt

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:pub="http://xmlns.oracle.com/oxp/service/PublicReportService">
   <soap:Header/>
   <soap:Body>
      <pub:runReport>
         <pub:reportRequest>
            <pub:reportAbsolutePath>/Custom/ADG Custom/Interfaces/HCM/Learning/Report/ADG_HCM_INT_097_Enrolment_Complettion_Of_Mandtory_Hours_Report.xdo</pub:reportAbsolutePath>
            <pub:sizeOfDataChunkDownload>-1</pub:sizeOfDataChunkDownload>
         </pub:reportRequest>
      </pub:runReport>
   </soap:Body>
</soap:Envelope>

https://iaaibv-test.fa.ocs.oraclecloud29.com


ADGE_HCM_INTEGRATION_SVC	
Welcome@123
